;************************************************************************************************************
; SPARTAN-II CLASS
;************************************************************************************************************
[SPARTAN-II_SSV X2SoldierClassTemplate]
+DisplayName="СПАРТАНЕЦ-II"
+ClassSummary= "Программа SPARTAN-II, первоначально известная как проект ORION Generation II, была частью программы SPARTAN, направленной на создание элитных солдат с помощью механической и биологической аугментации. Программа SPARTAN-II станет первой в серии, в которой передовые технологии экзоскелета будут сочетаться с превосходными физическими данными солдат".
+LeftAbilityTreeTitle="СПАРТАНЕЦ"
+RightAbilityTreeTitle="Дополнения"
+AbilityTreeTitles[0]="СПАРТАНЕЦ-II"
+AbilityTreeTitles[1]="Снайпер"
+AbilityTreeTitles[2]="Стрелок"
+AbilityTreeTitles[3]="Эксперт по сносу зданий"
+AbilityTreeTitles[4]="Тяжелый стрелок"
+AbilityTreeTitles[5]="Разведчик"
+AbilityTreeTitles[6]="Мастер клинка"


;ALPHABETICAL ORDER
+RandomNickNames[0]="Демон"
+RandomNickNames[1]="Утилизатор"
+RandomNickNames[2]="Законодатель"
+RandomNickNames[3]="Центурион"
+RandomNickNames[4]="Надзиратель"
+RandomNickNames[5]="Рейдер"
+RandomNickNames[6]="Завоеватель"
+RandomNickNames[7]="Военачальник"
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]="Валькирия"
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""

+RankNames[0]="Новобранец экипажа"
+RankNames[1]="Ученик члена экипажа"
+RankNames[2]="Член экипажа"
+RankNames[3]="Старшина третьего класса"
+RankNames[4]="Старшина второго класса"
+RankNames[5]="Старшина первого класса"
+RankNames[6]="Главный старшина"
+RankNames[7]= "Старший старший старшина"
+RankNames[8]="Мастер-главный старшина"

+ShortNames[0]="CR"
+ShortNames[1]="CA"
+ShortNames[2]="CN"
+ShortNames[3]="PO3"
+ShortNames[4]="PO2"
+ShortNames[5]="PO1"
+ShortNames[6]="CPO"
+ShortNames[7]="SCPO"
+ShortNames[8]="MCPO"

;************************************************************************************************************
; Nanosuit CLASS
;************************************************************************************************************
[Nanosuit_SSV X2SoldierClassTemplate]
+DisplayName="Оперативник в нанокостюме"
+ClassSummary="Нанокостюмы (также известные как наномышечные костюмы) - это мощные и чрезвычайно универсальные комплекты тактической боевой брони. Мышечные волокна CryFibril костюмов могут быть запрограммированы для различных целей (таких как укрепление, увеличение мышц или маскировка), что приводит к значительному повышению боевых и физических характеристик, позволяя оператору совершать сверхчеловеческие подвиги. Все нанокостюмы являются симбиотическими, что означает, что они физически связываются с пользователем и становятся своего рода второй кожей. Костюмы и пользователи в конечном итоге сливаются в одно существо".
+LeftAbilityTreeTitle="Нанокостюм"
+RightAbilityTreeTitle="Раптор"
+AbilityTreeTitles[0]="Нанокостюм"
+AbilityTreeTitles[1]="Снайпер"
+AbilityTreeTitles[2]="Стрелок"
+AbilityTreeTitles[3]="Эксперт по сносу зданий"
+AbilityTreeTitles[4]="Тяжелый стрелок"
+AbilityTreeTitles[5]="Разведчик"
+AbilityTreeTitles[6]="Мастер клинка"


;ALPHABETICAL ORDER
+RandomNickNames[0]="Пророк"
+RandomNickNames[1]="Кочевник"
+RandomNickNames[2]="Алькатрас"
+RandomNickNames[3]="Охотник"
+RandomNickNames[4]="Психо"
+RandomNickNames[5]="Рейнджер"
+RandomNickNames[6]="Ноль"
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""


;************************************************************************************************************
; Ghost CLASS
;************************************************************************************************************
[Ghost_SSV X2SoldierClassTemplate]
+DisplayName="Призрачный оперативник"
+ClassSummary="Призраки были выбраны из психически одаренных людей, обученных с младенчества направлять свою псионическую энергию на увеличение их естественной физической силы и выносливости. Призывники, успешно прошедшие строгую подготовку и повышение квалификации по программе Ghost, затем служили в качестве коммандос и наемных убийц. Призраки не имеют себе равных в своей способности проникать и убивать."
+LeftAbilityTreeTitle="Призрак"
+RightAbilityTreeTitle="Псион"
+AbilityTreeTitles[0]="Призрак"
+AbilityTreeTitles[1]="Псионика"
+AbilityTreeTitles[2]="Снайпер"
+AbilityTreeTitles[3]="Стрелок"
+AbilityTreeTitles[4]="Разведчик"
+AbilityTreeTitles[5]="Мастер клинка"


;ALPHABETICAL ORDER
+RandomNickNames[0]="Охотник"
+RandomNickNames[1]="Дэдшот"
+RandomNickNames[2]="Соло"
+RandomNickNames[3]="Мошенник"
+RandomNickNames[4]="Жнец"
+RandomNickNames[5]="Призрак"
+RandomNickNames[6]="Призрак"
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]="Аполлон"
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]="Королева"
+RandomNickNames_Female[1]="Нова"
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""


;************************************************************************************************************
; Ninja
;************************************************************************************************************
[Ninja_SSV X2SoldierClassTemplate]
+DisplayName="Ниндзя"
+ClassSummary="Ниндзя - это элитные воины, которые используют свои высокоразвитые техники и навыки для выполнения таких задач, как шпионаж, боевые операции и убийства. Их обучение начинается очень рано, и только после прохождения тестов и тренировок, настолько интенсивных, что их невозможно описать словами, они достигают своего истинного потенциала. Все члены клуба - специалисты высочайшего мастерства и знания мистических искусств."
+LeftAbilityTreeTitle="Шиноби"
+RightAbilityTreeTitle="Тень"
+AbilityTreeTitles[0]="Искусство ниндзюцу"
+AbilityTreeTitles[1]="Искусство Нинпо"
+AbilityTreeTitles[2]="Искусство клинка"
+AbilityTreeTitles[3]="Искусство импровизации"
+AbilityTreeTitles[4]="Полезность"

;ALPHABETICAL ORDER
+RandomNickNames[0]="Тень"
+RandomNickNames[1]="Убийца"
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]="Дракон"
+RandomNickNames_Male[1]="Ветер"
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]="Судьба"
+RandomNickNames_Female[1]="Убийца"
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""

+RankNames[0]="Новобранец ниндзя"
+RankNames[1]="Ученик ниндзя"
+RankNames[2]="Младший ниндзя"
+RankNames[3]="Обычный ниндзя"
+RankNames[4]="Продвинутый ниндзя"
+RankNames[5]="Великий ниндзя"
+RankNames[6]= "Элитный ниндзя"
+RankNames[7]= "Мастер ниндзя"
+RankNames[8]="Окончательный ниндзя"


+ShortNames[0]="NJR"
+ShortNames[1]="NJA"
+ShortNames[2]="LNJ"
+ShortNames[3]="CNJ"
+ShortNames[4]="АНЖИ"
+ShortNames[5]="GNJ"
+ShortNames[6]="ENJ"
+ShortNames[7]="MNJ"
+ShortNames[8]="UNJ"


;************************************************************************************************************
; Cyborg CLASS
;************************************************************************************************************
[Cyborg_SSV X2SoldierClassTemplate]
+DisplayName="Киборг"
+ClassSummary= "Кибернетический организм, более известный и называемый киборгом, - это существо, имеющее как биологические, так и искусственные части. Компоненты машины отличаются от протезов, поскольку они не только заменяют замененные части тела, но и улучшают их различными способами. Киборги оснащены экзоскелетом - несъемной кибернетикой всего тела, которая обладает различными преимуществами. Их тело поставляется с установленной боевой энергетической системой, которая позволяет им преодолевать различные сценарии на поле боя, но их доступная энергия ограничена для каждой миссии."
+LeftAbilityTreeTitle="Киборг"
+RightAbilityTreeTitle="DeusEx"
+AbilityTreeTitles[0]="Киборг"
+AbilityTreeTitles[1]="Снайпер"
+AbilityTreeTitles[2]="Стрелок"
+AbilityTreeTitles[3]="Эксперт по сносу зданий"
+AbilityTreeTitles[4]="Тяжелый стрелок"
+AbilityTreeTitles[5]="Разведчик"
+AbilityTreeTitles[6]="Мастер клинка"
+AbilityTreeTitles[7]="Хакер"


;ALPHABETICAL ORDER
+RandomNickNames[0]="Берсеркер"
+RandomNickNames[1]="Deus-Ex"
+RandomNickNames[2]="Металло"
+RandomNickNames[3]="Проект"
+RandomNickNames[4]="Кабель"
+RandomNickNames[5]="Джаггернаут"
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""


;************************************************************************************************************
; N7 Soldier CLASS
;************************************************************************************************************
[N7Soldier_SSV X2SoldierClassTemplate]
+DisplayName="Солдат-разрушитель N7"
+ClassSummary="Эти солдаты - спецназовцы Альянса, готовые идти куда угодно и сражаться с чем угодно, которые прошли подготовку в Академии Межпланетных боевых действий в Рио-де-Жанейро, Бразилия. Они должны были достойно и эффективно пережить боевые ситуации, чтобы получить ранг N7. Солдаты-разрушители - это воины полного спектра отряда, чьи таланты сосредоточены на повышении прочности и урона. Их способность к выбросу адреналина значительно повышает их боевую эффективность".
+LeftAbilityTreeTitle="N7"
+RightAbilityTreeTitle="Солдат"
+AbilityTreeTitles[0]="Солдат-разрушитель N7"
+AbilityTreeTitles[1]="Снайпер"
+AbilityTreeTitles[2]="Стрелок"
+AbilityTreeTitles[3]="Эксперт по сносу зданий"
+AbilityTreeTitles[4]="Тяжелый стрелок"
+AbilityTreeTitles[5]="Разведчик"
+AbilityTreeTitles[6]="Мастер клинка"
+AbilityTreeTitles[7]="Хакер"


;ALPHABETICAL ORDER
+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""


;************************************************************************************************************
; N7 Infiltrator CLASS
;************************************************************************************************************
[N7Infiltrator_SSV X2SoldierClassTemplate]
+DisplayName="Теневой лазутчик N7"
+ClassSummary="Эти солдаты - спецназовцы Альянса, готовые идти куда угодно и сражаться с чем угодно, которые прошли подготовку в Академии Межпланетных боевых действий в Рио-де-Жанейро, Бразилия. Они должны были достойно и эффективно пережить боевые ситуации, чтобы получить ранг N7. Теневые лазутчики используют имплантаты для улучшения ловкости, что делает их скользкими бойцами на поле боя. Их тактический плащ - бесценный инструмент, который значительно увеличивает их способность к убийству, проникновению, а также потенциал выживания на поле боя".
+LeftAbilityTreeTitle="N7"
+RightAbilityTreeTitle="Лазутчик"
+AbilityTreeTitles[0]="Теневой лазутчик N7"
+AbilityTreeTitles[1]="Снайпер"
+AbilityTreeTitles[2]="Стрелок"
+AbilityTreeTitles[3]="Эксперт по сносу зданий"
+AbilityTreeTitles[4]="Тяжелый стрелок"
+AbilityTreeTitles[5]="Разведчик"
+AbilityTreeTitles[6]="Мастер клинка"
+AbilityTreeTitles[7]="Хакер"


;ALPHABETICAL ORDER
+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""


;************************************************************************************************************
; N7 Engineer CLASS
;************************************************************************************************************
[N7Engineer_SSV X2SoldierClassTemplate]
+DisplayName="Инженер-разрушитель N7"
+ClassSummary="Эти солдаты - спецназовцы Альянса, готовые идти куда угодно и сражаться с чем угодно, которые прошли подготовку в Академии Межпланетных боевых действий в Рио-де-Жанейро, Бразилия. Они должны были достойно и эффективно пережить боевые ситуации, чтобы получить ранг N7. Инженер-разрушитель увеличил технический урон и получил доступ к непрерывному запасу взрывных гранат, чтобы еще больше увеличить свои разрушительные возможности. Он способен выводить из строя приоритетные цели и использует гранаты для атаки на расстоянии и терроризирования поля боя".
+LeftAbilityTreeTitle="N7"
+RightAbilityTreeTitle="Инженер"
+AbilityTreeTitles[0]="Инженер-разрушитель N7"
+AbilityTreeTitles[1]="Снайпер"
+AbilityTreeTitles[2]="Стрелок"
+AbilityTreeTitles[3]="Эксперт по сносу зданий"
+AbilityTreeTitles[4]="Тяжелый стрелок"
+AbilityTreeTitles[5]="Разведчик"
+AbilityTreeTitles[6]="Мастер клинка"
+AbilityTreeTitles[7]="Хакер"


;ALPHABETICAL ORDER
+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""

;************************************************************************************************************
; N7 Adept CLASS
;************************************************************************************************************
[N7Adept_SSV X2SoldierClassTemplate]
+DisplayName="Адепт ярости N7"
+ClassSummary="Эти солдаты - спецназовцы Альянса, готовые идти куда угодно и сражаться с чем угодно, которые прошли подготовку в Академии Межпланетных боевых действий в Рио-де-Жанейро, Бразилия. Они должны были достойно и эффективно пережить боевые ситуации, чтобы получить ранг N7. Адепты Ярости - это непревзойденные биотики, способные воздействовать на физический мир силой разума. Адепты - долговечные и мощные манипуляторы полями mass effect. Они могут использовать биотику для насильственного манипулирования объектами в окружающей среде, включая близлежащие вражеские цели".
+LeftAbilityTreeTitle="N7"
+RightAbilityTreeTitle="Адепт"
+AbilityTreeTitles[0]="N7 Biotics"
+AbilityTreeTitles[1]="Адепт ярости N7"
+AbilityTreeTitles[2]="Авангардная биотика N7"
+AbilityTreeTitles[3]="Снайпер"
+AbilityTreeTitles[4]="Стрелок"
+AbilityTreeTitles[5]="Эксперт по сносу зданий"
+AbilityTreeTitles[6]="Тяжелый стрелок"
+AbilityTreeTitles[7]="Разведчик"
+AbilityTreeTitles[8]="Мастер клинка"
+AbilityTreeTitles[9]="Хакер"


;ALPHABETICAL ORDER
+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""

;************************************************************************************************************
; N7 Vanguard CLASS
;************************************************************************************************************
[N7Vanguard_SSV X2SoldierClassTemplate]
+DisplayName="Авангард истребителей N7"
+ClassSummary="Эти солдаты - спецназовцы Альянса, готовые идти куда угодно и сражаться с чем угодно, которые прошли подготовку в Академии Межпланетных боевых действий в Рио-де-Жанейро, Бразилия. Они должны были достойно и эффективно пережить боевые ситуации, чтобы получить ранг N7. Авангард Истребителей - могущественные бойцы, способные сочетать в себе наступательные способности Адепта и Солдата. У них есть доступ к различным оружейным баффам, а также к биотическим способностям."
+LeftAbilityTreeTitle="N7"
+RightAbilityTreeTitle="Авангард"
+AbilityTreeTitles[0]="N7 Biotics"
+AbilityTreeTitles[1]="N7 Адепт биотики"
+AbilityTreeTitles[2]="Авангард истребителей N7"
+AbilityTreeTitles[3]="Снайпер"
+AbilityTreeTitles[4]="Стрелок"
+AbilityTreeTitles[5]="Эксперт по сносу зданий"
+AbilityTreeTitles[6]="Тяжелый стрелок"
+AbilityTreeTitles[7]="Разведчик"
+AbilityTreeTitles[8]="Мастер клинка"
+AbilityTreeTitles[9]="Хакер"


;ALPHABETICAL ORDER
+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""

;************************************************************************************************************
; N7 Sentinel CLASS
;************************************************************************************************************
[N7Sentinel_SSV X2SoldierClassTemplate]
+DisplayName="Страж паладина N7"
+ClassSummary="Эти солдаты - спецназовцы Альянса, готовые идти куда угодно и сражаться с чем угодно, которые прошли подготовку в Академии Межпланетных боевых действий в Рио-де-Жанейро, Бразилия. Они должны были достойно и эффективно пережить боевые ситуации, чтобы получить ранг N7. Страж паладина N7 несет на поле боя мощный щит, чтобы блокировать вражеский огонь. Паладин также использует щит в качестве тяжелого оружия ближнего боя."
+LeftAbilityTreeTitle="N7"
+RightAbilityTreeTitle="Страж"
+AbilityTreeTitles[0]="Страж паладина N7"
+AbilityTreeTitles[1]="Снайпер"
+AbilityTreeTitles[2]="Стрелок"
+AbilityTreeTitles[3]="Эксперт по сносу зданий"
+AbilityTreeTitles[4]="Тяжелый стрелок"
+AbilityTreeTitles[5]="Разведчик"
+AbilityTreeTitles[6]="Мастер клинка"
+AbilityTreeTitles[7]="Хакер"


;ALPHABETICAL ORDER
+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""
;MALE ONLY NICKNAMES
+RandomNickNames_Male[0]=""
+RandomNickNames_Male[1]=""
+RandomNickNames_Male[2]=""
+RandomNickNames_Male[3]=""
+RandomNickNames_Male[4]=""
+RandomNickNames_Male[5]=""
;FEMALE ONLY NICKNAMES
+RandomNickNames_Female[0]=""
+RandomNickNames_Female[1]=""
+RandomNickNames_Female[2]=""
+RandomNickNames_Female[3]=""
+RandomNickNames_Female[4]=""
+RandomNickNames_Female[5]=""